package com.omelchenkoaleks.addressbook;

/**
 * Предоставляет графический интерфейс для добавления нового
 * или редактирования существующего фрагмента.
 * Класс управляет компонентами TextInputLayout и кнопкой FloatingActionButton для добавления
 * нового или редактирования существующего контакта.
 * Вложенный интерфейс AddEditFragment определяет метод обратного вызова,
 * реализуемый MainActivity, чтобы активность могла реагировать на сохранение
 * нового или обновленного контакта.
 */
public class AddEditFragment {
}
