package com.omelchenkoaleks.addressbook;

/**
 * Отображает информацию одного контакта и предоставляет
 * команды меню для редактирования и удаления этого контакта.
 * Класс управляет компонентами TextView, в которых отображается информация
 * о выбранном контакте, и командами на панели приложения,
 * которые позволяют пользователю отредактировать или удалить текущий контакт.
 * Вложенный интерфейс DetailFragment определяет методы обратного вызова,
 * реализуемые MainActivity, чтобы активность могла реагировать на удаление
 * контакта или прикосновение к команде на панели приложения для редактирования контакта.
 */
public class DetailFragment {
}
